driver-tests/bpelse/xslt/DoXslTransformBPEL/src/text/EmployeeInfoToText.wsdl

<?xml version="1.0" encoding="windows-1252"?>
<definitions name="EmployeeInfoToText" targetNamespace="http://j2ee.netbeans.org/wsdl/DoXslTransformBPEL/EmployeeInfoToText"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/DoXslTransformBPEL/EmployeeInfoToText" xmlns:ns="http://sun.com/EmplInput" xmlns:ns0="http://sun.com/EmplOutput/Text" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/DoXslTransformBPEL/EmployeeInfoToText">
            <xsd:import namespace="http://sun.com/EmplOutput/Text" schemaLocation="EmployeeTextOutput.xsd"/>
            <xsd:import namespace="http://sun.com/EmplInput" schemaLocation="../basic/EmployeeInput.xsd"/>
        </xsd:schema>
    </types>
    <message name="EmployeeInfoToTextOperationRequest">
        <part name="part1" element="ns:EmployeeInput"/>
    </message>
    <message name="EmployeeInfoToTextOperationResponse">
        <part name="part1" element="ns0:EmployeeOutput"/>
    </message>
    <portType name="EmployeeInfoToTextPortType">
        <operation name="EmployeeInfoToTextOperation">
            <input name="input1" message="tns:EmployeeInfoToTextOperationRequest"/>
            <output name="output1" message="tns:EmployeeInfoToTextOperationResponse"/>
        </operation>
    </portType>
    <binding name="EmployeeInfoToTextBinding" type="tns:EmployeeInfoToTextPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="EmployeeInfoToTextOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="EmployeeInfoToTextService">
        <port name="EmployeeInfoToTextPort" binding="tns:EmployeeInfoToTextBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/EmployeeInfoToTextService/EmployeeInfoToTextPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="EmployeeInfoToText">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="EmployeeInfoToTextPortTypeRole" portType="tns:EmployeeInfoToTextPortType"/>
    </plnk:partnerLinkType>
</definitions>

