driver-tests/bpelse/xpathfunctions/XSDFunctionsJBI/test/results/doUnMarshalTest/Actual_20130325130719_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <EmployeeInput xmlns="http://sun.com/EmplInput" xmlns:emp="http://sun.com/EmplInput" xmlns:msgns="http://j2ee.netbeans.org/wsdl/unMarshal">
      <EmployeeNumber xmlns="">1234</EmployeeNumber>
      <LastName xmlns="">Doe</LastName>
      <FirstName xmlns="">John</FirstName>
      <JobTitle xmlns="">Technical Member</JobTitle>
      <HoursWorked xmlns="">2000</HoursWorked>
      <PayRate xmlns="">30.0</PayRate>
      </EmployeeInput>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>