ojc-core/component-common/component/test/com/sun/jbi/nms/wsdl11wrapper/util/ns-decl-elem.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" 
				  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
				  xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
				  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
				  xmlns:emp="http://sun.com/EmplInput">
  <soapenv:Body>
    <emp:EmployeeInput>
      <EmployeeNumber>?string?</EmployeeNumber>
      <LastName>?string?</LastName>
      <FirstName>?string?</FirstName>
      <JobTitle>?string?</JobTitle>
      <HoursWorked>?3?</HoursWorked>
      <PayRate>?3?</PayRate>
    </emp:EmployeeInput>
  </soapenv:Body>
</soapenv:Envelope>